#include "output.h"
//*连线说明：
//*1--SS  <----->PF0   浮空输入
//*2--SCK <----->PB13  推挽复用输出
//*3--MOSI<----->PB15  推挽复用输出
//*4--MISO<----->PB14  浮空输入
//*5--悬空
//*6--GND <----->GND   
//*7--RST <----->PF1   浮空输入
//*8--VCC <----->VCC
//////////////////////////////////////////////////////////////////////////////////	 

//输出输入驱动代码	   
									  
////////////////////////////////////////////////////////////////////////////////// 	   

void OUTPUT_Init(void)
{	
	RCC->APB2ENR|=3<<6|1<<3|1<<2; //开启PA,PB,PE，PF时钟
	GPIOB->CRH&=0x000FFFFF;
	GPIOB->CRH|=0x94900000;  //PB13\14\15
	GPIOA->CRL&=0xFFFFFFF0;


}
 
